app/controllers/flights_controller.rb

INSERT INTO "flights" ("arrival", "baggage_allowance", "capacity", "created_at", "departure", "destination", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save