app/controllers/seats_controller.rb

SELECT "seats".* FROM "seats"
---
  def index
    @seats = Seat.all

INSERT INTO "seats" ("baggage", "created_at", "flight_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["baggage", #<BigDecimal:7fa59dd348f8,'0.0',9(9)>], ["created_at", Thu, 11 Jul 2013 16:54:15 UTC +00:00], ["flight_id", 9], ["name", "AAAA"], ["updated_at", Thu, 11 Jul 2013 16:54:15 UTC +00:00]]
---
  def create
    @seat = Seat.new(seat_params)

    respond_to do |format|
      if @seat.save

SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT 1  [["id", "2"]]
---
  def flight_seats
    @flight = Flight.find (params[:flight_id])

SELECT "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT 1  [["id", "10"]]
---
    def set_seat
      @seat = Seat.find(params[:id])